Exercise with csv

In [1]:
import pandas as pd

In [25]:
df = pd.read_csv("data/ex2.csv", sep=',',header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [29]:
#let's specify the header
names = ['a', 'b', 'c', 'd','message']
pd.read_csv('data/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [31]:
#we can specify the lines that shouldn't be in the dataframe

pd.read_csv("data/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
import numpy as np
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [35]:
#remove missing number
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [36]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [37]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [58]:
data1 = pd.DataFrame([[1., 6.5, 3.], [3, 5., 9, 32] ,[1, 5 , np.nan, np.nan], [np.nan, 4, 6 ,np.nan]])
data1

     0    1    2     3
0  1.0  6.5  3.0   NaN
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   NaN
3  NaN  4.0  6.0   NaN

In [46]:
data1.dropna(inplace=True)
data1

     0    1    2     3
1  3.0  5.0  9.0  32.0

In [49]:
data1.dropna(axis=1, inplace=True)
data1

     1
0  6.5
1  5.0
2  5.0
3  4.0

In [54]:
#data.dropna(how='all')
data1.dropna(how='any')

     0    1    2     3
1  3.0  5.0  9.0  32.0

In [ ]:
#delete the lines that have atleast 2 nan
df.dropna(tresh=2)

In [ ]:
data1.fillna(42) #replace the nan with 32

      0    1     2     3
0   1.0  6.5   3.0  42.0
1   3.0  5.0   9.0  32.0
2   1.0  5.0  42.0  42.0
3  42.0  4.0   6.0  42.0

In [61]:
data1

     0    1    2     3
0  1.0  6.5  3.0   NaN
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   NaN
3  NaN  4.0  6.0   NaN

In [ ]:
data1.fillna({0: 0.5, 3: 0}) #fill the nan based on the column, use inplace if you want that the change is defined

     0    1    2     3
0  1.0  6.5  3.0   0.0
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   0.0
3  0.5  4.0  6.0   0.0

In [66]:
data1.fillna(data1.mean())

          0    1    2     3
0  1.000000  6.5  3.0  32.0
1  3.000000  5.0  9.0  32.0
2  1.000000  5.0  6.0  32.0
3  1.666667  4.0  6.0  32.0

Removing Duplicates

In [68]:
data2 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data2.duplicated() #if the rows is duplicated

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [70]:
data2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
data = pd.DataFrame({'device': ['iphone', 'galaxy', 'ipad'], 'price': [987, 1045, 680]})
data

   device  price
0  iphone    987
1  galaxy   1045
2    ipad    680

In [74]:
device_brand = {'iphone': 'Apple', 'ipad': 'Apple', 'galaxy': 'Samsung'}

In [75]:
#new column with the info from dict

data['brand'] = data['device'].str.lower().map(device_brand)
data

   device  price    brand
0  iphone    987    Apple
1  galaxy   1045  Samsung
2    ipad    680    Apple

Replacing

In [76]:
data = pd.Series([1, 4, 6, 8, 99, 99])
data

0     1
1     4
2     6
3     8
4    99
5    99
dtype: int64

In [ ]:
data.replace([99], np.nan)
#data.replace(99 : 0, 6: 3)

0    1.0
1    4.0
2    6.0
3    8.0
4    NaN
5    NaN
dtype: float64

In [81]:
ages = [20, 15, 14, 12, 18, 32, 36]
bins = [12, 15, 20, 32, 100]

In [84]:
values = pd.cut(ages, bins)
print(values)

[(15.0, 20.0], (12.0, 15.0], (12.0, 15.0], NaN, (15.0, 20.0], (20.0, 32.0], (32.0, 100.0]]
Categories (4, interval[int64, right]): [(12, 15] < (15, 20] < (20, 32] < (32, 100]]

In [ ]:
values.codes #you see in which category belong one number

array([ 1,  0,  0, -1,  1,  2,  3], dtype=int8)

In [88]:
pd.value_counts(values)

C:\Users\halima\AppData\Local\Temp\ipykernel_11844\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

(12, 15]     2
(15, 20]     2
(20, 32]     1
(32, 100]    1
Name: count, dtype: int64

In [91]:
pd.cut(ages, 3).categories

IntervalIndex([(11.976, 20.0], (20.0, 28.0], (28.0, 36.0]], dtype='interval[float64, right]')

In [95]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c','a', 'c'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   c      5

In [99]:
dummies = pd.get_dummies(df['key'], dtype='int')

In [101]:
#join tabledummies+ column data1
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  a  b  c
0      0  0  1  0
1      1  0  1  0
2      2  1  0  0
3      3  0  0  1
4      4  1  0  0
5      5  0  0  1